Merge pull request #38 from nycolemedina-lab/kevin
Improving the flowchart with Mermaid.
